gestionsolicitudessuscripcion/WebContent/templates/generarSolicitud.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  </soap:Header>
  <soapenv:Body>
    <ser:generarSolicitudSol xmlns:ser="http://xmlns.mercantilseguros.com/osb/serviciosolicitudessuscripcion" xmlns:obj="http://xmlns.mercantilseguros.com/osb/ObjetosComunes">
      <ser:cabeceraSol>
        <obj:fecha></obj:fecha>
        <obj:hora></obj:hora>
        <!--Optional:-->
        <obj:idSolicitud></obj:idSolicitud>
        <!--Optional:-->
        <obj:idCompensacion></obj:idCompensacion>
        <!--Optional:-->
        <obj:canal></obj:canal>
        <!--Optional:-->
        <obj:comunidad></obj:comunidad>
        <!--Optional:-->
        <obj:grupo></obj:grupo>
        <!--Optional:-->
        <obj:funcionalidad></obj:funcionalidad>
        <obj:aplicacion></obj:aplicacion>
        <obj:usuario></obj:usuario>
        <obj:ip></obj:ip>
        <!--Optional:-->
        <obj:nombreEquipo></obj:nombreEquipo>
      </ser:cabeceraSol>
      <!--Optional:-->
      <ser:objetoSolicitud>
        <!--Optional:-->
        <ser:solnNuSolicitud></ser:solnNuSolicitud>
        <!--Optional:-->
        <ser:solnCdLineNegocio></ser:solnCdLineNegocio>
        <!--Optional:-->
        <ser:solnTpPoliza></ser:solnTpPoliza>
        <!--Optional:-->
        <ser:solnCapuCarpCdRamo></ser:solnCapuCarpCdRamo>
        <!--Optional:-->
        <ser:solnCdProducto></ser:solnCdProducto>
        <!--Optional:-->
        <ser:solnTpSolicitud></ser:solnTpSolicitud>
        <!--Optional:-->
        <ser:solnTpMovimiento></ser:solnTpMovimiento>
        <!--Optional:-->
        <ser:solnCasuCdSucursal></ser:solnCasuCdSucursal>
        <!--Optional:-->
        <ser:solnCamoCdMoneda></ser:solnCamoCdMoneda>
        <!--Optional:-->
        <ser:solnInReferidos></ser:solnInReferidos>
        <!--Optional:-->
        <ser:solnNuReferimiento></ser:solnNuReferimiento>
        <!--Optional:-->
        <ser:solnInLicitacion></ser:solnInLicitacion>
        <!--Optional:-->
        <ser:solnIndole></ser:solnIndole>
        <!--Optional:-->
        <ser:solnTpMomodificacion></ser:solnTpMomodificacion>
        <!--Optional:-->
        <ser:solnCdSucursal></ser:solnCdSucursal>
        <!--Optional:-->
        <ser:solnCdRamo></ser:solnCdRamo>
        <!--Optional:-->
        <ser:solnNuPoliza></ser:solnNuPoliza>
        <!--Optional:-->
        <ser:solnNuCertificado></ser:solnNuCertificado>
        <!--Optional:-->
        <ser:solnCantOperaciones></ser:solnCantOperaciones>
        <!--Optional:-->
        <ser:solnCdNacionalidadSol></ser:solnCdNacionalidadSol>
        <!--Optional:-->
        <ser:solnNuCedulaSol></ser:solnNuCedulaSol>
        <!--Optional:-->
        <ser:solnNmSolicitante></ser:solnNmSolicitante>
        <!--Optional:-->
        <ser:solnCdEmail1Sol></ser:solnCdEmail1Sol>
        <!--Optional:-->
        <ser:solnCdEmail2Sol></ser:solnCdEmail2Sol>
        <!--Optional:-->
        <ser:solnCdAreaHabSol></ser:solnCdAreaHabSol>
        <!--Optional:-->
        <ser:solnNuTelefonoHabSol></ser:solnNuTelefonoHabSol>
        <!--Optional:-->
        <ser:solnCdAreaCelSol></ser:solnCdAreaCelSol>
        <!--Optional:-->
        <ser:solnNuCelularSol></ser:solnNuCelularSol>
        <!--Optional:-->
        <ser:solnNmPersonaContacto></ser:solnNmPersonaContacto>
        <!--Optional:-->
        <ser:solnCdEmail1Contacto></ser:solnCdEmail1Contacto>
        <!--Optional:-->
        <ser:solnCdEmail2Contacto></ser:solnCdEmail2Contacto>
        <!--Optional:-->
        <ser:solnCdAreaHabContacto></ser:solnCdAreaHabContacto>
        <!--Optional:-->
        <ser:solnNuTelefHabContacto></ser:solnNuTelefHabContacto>
        <!--Optional:-->
        <ser:solnCdAreaCelContacto></ser:solnCdAreaCelContacto>
        <!--Optional:-->
        <ser:solnNuCelularContacto></ser:solnNuCelularContacto>
        <!--Optional:-->
        <ser:solnInTomador></ser:solnInTomador>
        <!--Optional:-->
        <ser:solnCdNacionalidadToma></ser:solnCdNacionalidadToma>
        <!--Optional:-->
        <ser:solnNuCedulaToma></ser:solnNuCedulaToma>
        <!--Optional:-->
        <ser:solnNmTomador></ser:solnNmTomador>
        <!--Optional:-->
        <ser:solnObservaciones></ser:solnObservaciones>
        <!--Optional:-->
        <ser:solnStSolicitud></ser:solnStSolicitud>
        <!--Optional:-->
        <ser:solnDeSolicitud></ser:solnDeSolicitud>
        <!--Optional:-->
        <ser:solnStCrm></ser:solnStCrm>
      </ser:objetoSolicitud>
      <!--Optional:-->
      <ser:cdFuncionalidad></ser:cdFuncionalidad>
      <!--Optional:-->
      <ser:cdAplicacion></ser:cdAplicacion>
      <!--Optional:-->
      <ser:cdUsuario></ser:cdUsuario>
    </ser:generarSolicitudSol>
  </soapenv:Body>
</soapenv:Envelope>
